Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionPipeStandard.WallDesignThickness
Represents wall design thickness of rectangle.
Remarks:
Design thickness of pipe wall is value should be thinner value than measured real value (nominal).
In EN standard it is marked as "d". //Need to be verified!!!!!!!
In ACI standard it is marked as "d". //Need to be verified!!!!!!!
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionPipeStandard.WallNominalThickness
Represents wall nominal thickness of rectangle.
Remarks:
Nominal is measured real value of profile, should be thicker than designed.
In EN standard it is marked as "d". //Need to be verified!!!!!!!
In ACI standard it is marked as "d". //Need to be verified!!!!!!!
Since:
2015